# Determinant Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform..::..Determinant Property
Transform Class See Also
---
The determinant of this transformation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Determinant { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Determinant As Double
	Get
```

Visual C++
---
```text
public:
property double Determinant {
	double get ();
}
```

# Remarks
The geometric meaning of a determinant is as the scale factor for volume when applied as linear transformation.
# See Also
Transform Class
Autodesk.Revit.DB Namespace